
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоНовый = НЕ Параметры.Свойство("id", id);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЭтоНовый Тогда
		Попытка
			ЗаполнитьДанныеОбъекта(id);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Попытка
		ЗаписатьДанныеОбъекта(id);
		Оповестить("Запись_Vendor");
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Записать(Команда);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеОбъекта(id)
	ДанныеОбъекта = ПолучитьДанныеОбъекта(id);
	
	Код = ДанныеОбъекта.code;
	Наименование = ДанныеОбъекта.name;
	Описание = ДанныеОбъекта.description;
	Скрыт = ДанныеОбъекта.isHidden;
	
	Если ДанныеОбъекта.image <> Неопределено Тогда
		Изображение = ДанныеОбъекта.image.id;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеОбъекта(id)
	ДанныеОбъекта = Новый Структура();
	ДанныеОбъекта.Вставить("code", Код);
	ДанныеОбъекта.Вставить("name", Наименование);
	ДанныеОбъекта.Вставить("description", Описание);
	ДанныеОбъекта.Вставить("image", Новый Структура("id, presentation", Изображение, ""));
	ДанныеОбъекта.Вставить("isHidden", Скрыт);
	
	СохранитьДанныеОбъекта(id, ДанныеОбъекта);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеОбъекта(id, ДанныеОбъекта)
	ТелоЗапроса = json.ПолучитьСтроку(ДанныеОбъекта);
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	
	Соединение = Новый HTTPСоединение(АдресХоста);
	Если ЭтоНовый Тогда
		Запрос = Новый HTTPЗапрос("/vendors", Заголовки);
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	Иначе
		Запрос = Новый HTTPЗапрос("/vendors/" + id, Заголовки);
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		Ответ = Соединение.ВызватьHTTPМетод("PUT", Запрос);
	КонецЕсли;
	
	Если Ответ.КодСостояния < 200 или Ответ.КодСостояния >= 300 Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		ВызватьИсключение("КодСостояния: " + Ответ.КодСостояния);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеОбъекта(id)
	Соединение = Новый HTTPСоединение(АдресХоста);
	Запрос = Новый HTTPЗапрос("/vendors/" + id);
	Ответ = Соединение.ВызватьHTTPМетод("GET", Запрос);
	
	Если Ответ.КодСостояния < 200 или Ответ.КодСостояния >= 300 Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		ВызватьИсключение("КодСостояния: " + Ответ.КодСостояния);
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	Результат = json.ПрочитатьСтроку(ТелоОтвета);
	
	ДанныеСтрокой = json.ПолучитьСтроку(Результат); // TODO: Исправить вывод в несколько строк
	Возврат Результат.data;
КонецФункции
