
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДанныеСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_Vendor" Тогда
		ОбновитьДанныеСписка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ФормаОбъекта = ПолучитьФорму("Справочник.Vendor.Форма.Объект");
	ФормаОбъекта.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДанныеСписка();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("id", Элемент.ТекущиеДанные.id);
	
	ФормаОбъекта = ПолучитьФорму("Справочник.Vendor.Форма.Объект", ПараметрыОткрытия);
	ФормаОбъекта.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеСписка()
	Попытка
		Список.Очистить();
		ЗаполнитьДанныеСписка();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСписка()
	ДанныеСписка = ПолучитьДанныеСписка();
	
	Для каждого ДанныеОбъекта из ДанныеСписка Цикл
		НовыйОбъект = Список.Добавить();
		НовыйОбъект.id = ДанныеОбъекта.id;
		НовыйОбъект.Код = ДанныеОбъекта.code;
		НовыйОбъект.Наименование = ДанныеОбъекта.name;
		НовыйОбъект.Описание = ДанныеОбъекта.description;
		НовыйОбъект.Скрыт = ДанныеОбъекта.isHidden;
		
		Если ДанныеОбъекта.image <> Неопределено Тогда
			Изображение = ДанныеОбъекта.image.id;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеСписка()
	Соединение = Новый HTTPСоединение(АдресХоста);
	Запрос = Новый HTTPЗапрос("/vendors");
	Ответ = Соединение.ВызватьHTTPМетод("GET", Запрос);
	
	Если Ответ.КодСостояния < 200 или Ответ.КодСостояния >= 300 Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		ВызватьИсключение("КодСостояния: " + Ответ.КодСостояния);
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	Результат = json.ПрочитатьСтроку(ТелоОтвета);
	
	ДанныеСтрокой = json.ПолучитьСтроку(Результат); // TODO: Исправить вывод в несколько строк
	Возврат Результат.data;
КонецФункции
